coyote/app/controllers/rooms_controller.rb

  def new
    user = User.find(session[:user_id])
    user.wait = "true"
    user.save
    #@count = User.find_by_sql(['select count(*) from users where wait = "t"'])
    @count = User.where('wait = "t"').count
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "wait" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["wait", "t"], ["updated_at", "2017-06-08 17:46:27.910058"], ["id", 20]]
SELECT COUNT(*) FROM "users" WHERE (wait = "t")