coyote/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("name", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "123"], ["password", "124"], ["email", "122"], ["created_at", "2017-06-08 10:20:58.672788"], ["updated_at", "2017-06-08 10:20:58.672788"]]