app/controllers/users_controller.rb

INSERT INTO "users" ("userid", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["userid", "fwads"], ["password", "sdfa"], ["created_at", "2017-06-20 10:46:08.035471"], ["updated_at", "2017-06-20 10:46:08.035471"]]
---
  def create
    @user = User.new
    @user.name = params[:name]
    @user.userid = params[:userid]
    @user.password = params[:password]
    if @user.save